cases/openfoam.com/complexMeshMotion/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    inlet 
    {
        type            pressureInletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ACMI1_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ACMI2_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }

    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
