cases/openfoam.com/complexMeshMotion/system/topoSetCellZoneDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create cellZone for passive scalar 
    // Need to be seperated as the command
    // createBaffles -overwrite, will remove the sets which were created
    // already
    {
        name    scalarCellSet;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 ( 0 0 -0.05 );
            p2 ( 0 0  0.05);
            radius 0.01;
        }
    }
);

// ************************************************************************* //
